export default {
    /**
     * 密码正则 6-16位长度
     */
    loginpwd: /^[\w\d\a-zA-Z]\w{5,15}$/, 
    /**
     * 6位数字支付密码
     */
    paypwd: /^\d{6}$/,
    /**
     * 手机号码
     */
    phone: /^(1)((3)|(4)|(5)|(7)|(8)|(9))\d{9}$/, 
    /**
     * 固定电话
     */
    telphone: /^\d{2,5}-\d{5,8}$/,
    /**
     * 身份证号
     */
    idcard: /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9Xx])$/,
    /**
     * 数字是否带小数点
     */
    float: /^\d+(\.\d+)?$/,
    /**
     * 车牌
     */
    car:/^([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}(([0-9]{5}[DF])|([DF]([A-HJ-NP-Z0-9])[0-9]{4})))|([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳]{1})$/, 
}